app/views/collections/show.html.erb

							<section class="products_container category_grid clearfix m_bottom_15">
							<% if @collection.products.count > 0 %>
---
SELECT COUNT(*) FROM "products" WHERE "products"."collection_id" = ?  [["collection_id", 151]]