app/views/product_categories/blocks/_categories_list.html.erb


 <% if @product_category.product_categories.count > 0 %>
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_category_id" = ?  [["product_category_id", 1]]
SELECT COUNT(*) FROM "product_categories" WHERE "product_categories"."product_category_id" = ?  [["product_category_id", 1]]