app/views/product_categories/blocks/_collections_list.html.erb

SELECT "collections".* FROM "collections" INNER JOIN "connections" ON "collections"."id" = "connections"."collection_id" WHERE "connections"."product_category_id" = ?  [["product_category_id", 6]]
---
<% @product_category.collections.each do |collection| %>