app/views/product_categories/blocks/sidebar/_sidebar.html.erb


   <% if product_category.product_categories.count > 0 %>
---
SELECT COUNT(*) FROM "product_categories" WHERE "product_categories"."product_category_id" = ?  [["product_category_id", 8]]