app/views/product_categories/index.html.erb

SELECT "product_categories".* FROM "product_categories"
SELECT COUNT(*) FROM "product_categories" WHERE "product_categories"."product_category_id" = ?  [["product_category_id", 8]]
---
							<% @product_categories.each do |product_category| %>
							  <% if product_category.product_categories.count > 0 %>