app/views/product_categories/show.html.erb

SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_category_id" = ?  [["product_category_id", 1]]
SELECT COUNT(*) FROM "product_categories" WHERE "product_categories"."product_category_id" = ?  [["product_category_id", 1]]
---

<% if @product_category.product_categories.count > 0  %>

SELECT COUNT(*) FROM "collections" INNER JOIN "connections" ON "collections"."id" = "connections"."collection_id" WHERE "connections"."product_category_id" = ?  [["product_category_id", 1]]
---

<% if @product_category.collections.count > 0  %>