app/views/collections/blocks/_products_list.html.erb

SELECT "products".* FROM "products" WHERE "products"."collection_id" = ?  [["collection_id", 151]]
SELECT COUNT(*) FROM "products" WHERE "products"."collection_id" = ?  [["collection_id", 151]]
---
<% @collection.products.paginate(:page => params[:page], :per_page => 9).each do |product| %>