app/controllers/collections_controller.rb

    def set_collection
      @collection = Collection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", 151]]