app/controllers/product_categories_controller.rb

  def index
    @product_categories = ProductCategory.all
    @product_category_menu = Menu.where(place: "catalog_menu").first
---
SELECT "product_categories".* FROM "product_categories"
SELECT  "menus".* FROM "menus" WHERE "menus"."place" = ?  ORDER BY "menus"."id" ASC LIMIT 1  [["place", "main_menu"]]

  def show
    @product_category_menu = Menu.where(place: "catalog_menu").first
---
SELECT  "menus".* FROM "menus" WHERE "menus"."place" = ?  ORDER BY "menus"."id" ASC LIMIT 1  [["place", "main_menu"]]

    def set_product_category
      @product_category = ProductCategory.find(params[:id])
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_category_id" = ?  [["product_category_id", 1]]