app/controllers/static_controller.rb

SELECT  "sliders".* FROM "sliders"  ORDER BY "sliders"."id" ASC LIMIT 1
---
	def home

		@slider = Slider.first